app/Services/user/TransactionService.php

select * from `transaction_details` inner join `transaction_headers` on `transaction_details`.`transaction_header_id` = `transaction_headers`.`id` where exists (select * from `obats` where `transaction_details`.`obat_id` = `obats`.`id`) and `transaction_headers`.`user_id` = 13 and `transaction_headers`.`status_id` in (1, 2) order by `transaction_headers`.`transaction_date` desc
---
   public function showOngoingTransactions() {
      $ongoingTransactions = TransactionDetail::with([
         'transactionHeader.status',
         'obat'
      ])
      ->join('transaction_headers', 'transaction_details.transaction_header_id', '=', 'transaction_headers.id')
      ->has('obat')
      ->where('transaction_headers.user_id', '=', auth()->user()->id)
      ->whereIn('transaction_headers.status_id', [1, 2])
      ->latest('transaction_headers.transaction_date')
      ->get();

select * from `obats` where `obats`.`id` in (5)
select * from `statuses` where `statuses`.`id` in (3)
select * from `transaction_details` inner join `transaction_headers` on `transaction_details`.`transaction_header_id` = `transaction_headers`.`id` where exists (select * from `obats` where `transaction_details`.`obat_id` = `obats`.`id`) and `transaction_headers`.`user_id` = 13 and `transaction_headers`.`status_id` in (3) order by `transaction_headers`.`transaction_date` desc
select * from `transaction_headers` where `transaction_headers`.`id` in (8)
---
   public function showSucceedTransactions() {
      $succeedTransactions = TransactionDetail::with([
         'transactionHeader.status',
         'obat'
      ])
      ->join('transaction_headers', 'transaction_details.transaction_header_id', '=', 'transaction_headers.id')
      ->has('obat')
      ->where('transaction_headers.user_id', '=', auth()->user()->id)
      ->whereIn('transaction_headers.status_id', [3])
      ->latest('transaction_headers.transaction_date')
      ->get();