app/Services/admin/obatService.php

insert into `obats` (`obat_name`, `obat_price`, `obat_ingredients`, `obat_description`, `category_id`, `obat_photo`, `excerpt`, `updated_at`, `created_at`) values ('Antimo', '13000', 'dengan sirup manis', 'Dapat mengurasi rasa sakit panas yang tinggi', '1', 'public/uploaded-obat-photo/cFNezPhePbDZFN8vbBCfbx7vRHyhD6oCvK9FJjtl.jpg', 'Dapat mengurasi rasa sakit panas yang tinggi', '2023-06-20 07:38:02', '2023-06-20 07:38:02')
---
   public function createobat($request) {
      $newobat = $request->validated();

      $newobat["obat_photo"] = $request->file('obat_photo')->store('public/uploaded-obat-photo');
      $newobat["excerpt"] = Str::limit(strip_tags($request->obat_description, 20));

      $obat = obat::create($newobat);

select * from `obats` where `obats`.`id` = '1' limit 1
---
   public function findobatToDelete($id) {
      $obat = obat::where('obats.id', '=', $id)->first();

delete from `obats` where `id` = 1
---
   public function deleteobat($obat) {
      Storage::delete($obat->obat_photo);
      $obat->delete();