app/Services/admin/TransactionService.php

   public function showTransactions() {
      $transactions = TransactionDetail::with([
         'transactionHeader.user',
         'transactionHeader.status',
         'obat'
      ])
      ->join('transaction_headers', 'transaction_details.transaction_header_id', '=', 'transaction_headers.id')
      ->has('obat')
      ->orderBy('transaction_headers.status_id')
      ->get();
---
select * from `transaction_details` inner join `transaction_headers` on `transaction_details`.`transaction_header_id` = `transaction_headers`.`id` where exists (select * from `obats` where `transaction_details`.`obat_id` = `obats`.`id`) order by `transaction_headers`.`status_id` asc