app/Http/Controllers/AdminController.php

select * from `obats`
---
   public function showAdminPage() {
      $transactions = $this->transactionService->showTransactions();

      return view('admin.home', [
         'title' => 'Admin',
         'transactions' => $transactions,
         'obats' => obat::all()

select * from `categories`
---
   public function showAddobatForm() {
      return view('admin.add-obat', [
         'title' => 'Add obat',
         'categories' => Category::all()