app/Http/Controllers/UserController.php

   public function showUserPage() {
      return view('user.home', [
         'title' => 'User',
         'cheeses' => obat::where('category_id', 1)->get(),
         'strawberrys' => obat::where('category_id', 2)->get(),
         'chocolates' => obat::where('category_id', 3)->get(),
         'obats' => obat::all()
      ]);
---
select * from `obats` where `category_id` = 1
select * from `obats`